Amiya200/stm32_water_tank/Core/Src/model_handle.c
    // Only complete on full; keep asserting motor otherwise
    if (isTankFull()) {
        semiAutoActive = false;
        ModelHandle_StopAllModesAndMotor();
        //printf("Semi-Auto Complete: Tank Full\r\n");
        return;
    }

    // Keep motor ON during semi-auto (protections may still cut it)
    if (!Motor_GetStatus()) start_motor();
}

/* =======================
   PROTECTIONS
   ======================= */
static void protections_tick(void)
{
    /* Manual override → only hard protections */
    if (manualOverride && manualActive) {
        if (senseOverLoad && motorStatus == 1U) ModelHandle_StopAllModesAndMotor();
        if (senseOverUnderVolt) ModelHandle_StopAllModesAndMotor();
        if (maxRunTimerArmed && (now_ms() - maxRunStartTick) >= MAX_CONT_RUN_MS) {
            ModelHandle_StopAllModesAndMotor();
            senseMaxRunReached = true;
        }
        return;
    }

    /* DRY-RUN: delayed stop */
    if (motorStatus == 1U) {
        if (dry_raw_is_dry()) {
            senseDryRun = true; // show on UI while counting
            if (!dryTimerArmed) {
                dryTimerArmed   = true;
                dryStopDeadline = now_ms() + (uint32_t)DRY_STOP_DELAY_SECONDS * 1000UL;
            } else {
                if ((int32_t)(dryStopDeadline - now_ms()) <= 0) {
                    ModelHandle_StopAllModesAndMotor();
                    // Keep flag true until user action clears (or water returns and motor restarts)
                }
            }
        } else {
            // water found => cancel dry timer & flag
            dryTimerArmed   = false;
            dryStopDeadline = 0;
            senseDryRun     = false;
        }
    } else {
        // motor is off; reset dry timing
        dryTimerArmed   = false;
        dryStopDeadline = 0;
        // keep senseDryRun as-is for UI; it will clear on next water detection
    }

    /* Other protections -> hard clear */
    if (senseOverLoad && motorStatus == 1U) ModelHandle_StopAllModesAndMotor();
    if (senseOverUnderVolt) ModelHandle_StopAllModesAndMotor();

    if (maxRunTimerArmed && (now_ms() - maxRunStartTick) >= MAX_CONT_RUN_MS) {
        ModelHandle_StopAllModesAndMotor();
        senseMaxRunReached = true;
    }
}

/* =======================
   LEDs
   ======================= */
static void leds_from_model(void)
{
    LED_ClearAllIntents();

    if (motorStatus == 1U) {
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 0);
    }
    if (countdownActive) {
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_BLINK, 500);
    }
    if (senseDryRun) {
        LED_SetIntent(LED_COLOR_RED, LED_MODE_STEADY, 0);
    }
    if (senseMaxRunReached) {
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 400);
    }
    if (senseOverLoad) {
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);
    }
    if (senseOverUnderVolt) {
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);
    }

    LED_ApplyIntents();
}

/* =======================
   Public Motor APIs
   ======================= */
void ModelHandle_SetMotor(bool on)
{
    if (on) {
        clear_all_modes();         // turning ON directly should not have stray modes
        manualOverride = true;
        start_motor();
    } else {
        ModelHandle_StopAllModesAndMotor();
    }
}
void ModelHandle_ClearManualOverride(void) { manualOverride = false; }
bool Motor_GetStatus(void) { return (motorStatus == 1U); }

/* =======================
   Main pump
   ======================= */
void ModelHandle_Process(void)
{
    /* keep your original order of tickers */
    countdown_tick();
    twist_tick();     // critical for Twist mode
    search_tick();
    timer_tick();
    semi_auto_tick();

    /* --- Aux Burst auto-OFF (Relays 2 & 3) --- */
    if (auxBurstActive) {
        uint32_t nowt = HAL_GetTick();
        if ((int32_t)(auxBurstDeadlineMs - nowt) <= 0) {
            Relay_Set(2, false);
            Relay_Set(3, false);
            auxBurstActive = false;
        }
    }

    protections_tick();
    leds_from_model();
}

/* =======================
   UART commands
   ======================= */
void ModelHandle_ProcessUartCommand(const char* cmd)
{
    if (!cmd || !*cmd) return;

    if      (strcmp(cmd, "MOTOR_ON") == 0)  { ModelHandle_SetMotor(true); } //printf("Manual ON (UART)\r\n"); }
    else if (strcmp(cmd, "MOTOR_OFF")== 0)  { ModelHandle_SetMotor(false);} //printf("Manual OFF (UART)\r\n"); }
    else if (strcmp(cmd, "SEMI_AUTO_START")==0) { ModelHandle_StartSemiAuto(); }
    else if (strcmp(cmd, "SEMI_AUTO_STOP")==0)  { ModelHandle_StopSemiAuto(); }
    else if (strcmp(cmd, "TWIST_START")==0)     { ModelHandle_StartTwist(twistSettings.onDurationSeconds, twistSettings.offDurationSeconds); }
    else if (strcmp(cmd, "TWIST_STOP")==0)      { ModelHandle_StopTwist(); }
    else if (strcmp(cmd, "SEARCH_START")==0)    { ModelHandle_StartSearch(searchSettings.testingGapSeconds, searchSettings.dryRunTimeSeconds); }
    else if (strcmp(cmd, "SEARCH_STOP")==0)     { ModelHandle_StopSearch(); }
    else if (strcmp(cmd, "RESET_ALL")==0)       { ModelHandle_ResetAll(); }
}
